Repository: FGM/g2
Catalog: po/g2-*.po
Languages: fr

source: entry autocomplete
fr: autocomplétion des termes

source: G2 entries by name
fr: Termes G2 par nom

source: entries starting by initial %initial
fr: Termes commençant par %initial

source: G2 glossary main page
fr: Page d'accueil du glossaire G2

source: G2 word of the day RSS feed
fr: Flux RSS: mot du jour G2

source: Wipe all G2 referer information
fr: Effacer toutes les informations de référents G2

source: Word of the day in the G2 glossary
fr: Le mot du jour dans le glossaire G2

source: A daily definition from the G2 Glossary at %site
fr: Une définition par jour, depuis le glossaire G2 de %site

source: <p>Displaying %count entries starting by '%initial' from a total number of %total entries.</p>
fr: <p>Affichage de %count termes commençant par '%initial' sur un total de %total termes.</p>

source: <p>Admin info: there are also %count unpublished matching entries from a total number of %total unpublished entries.</p>
fr: <p>Informations administrateur: il existe aussi %count termes non publiés qui correspondent, sur un total de %total termes non publiés.

source: G2 Alphabar
fr: Alphabarre G2

source: G2 Random
fr: Aléa G2

source: G2 Top
fr: Top G2

source: G2 Word of the day
fr: Mot du jour G2

source: List of initials to be included in alphabar
fr: Liste des initiales à inclure dans l'alphabarre

source: The alphabar lists the initials for which links to initial pages will be included.
fr: L'alphabarre liste les initiales pour lesquelles des pages par initiale seront proposées.

source: Maximum length of lines in the alphabar
fr: Longueur maximale des lignes dans l'alphabarre.

source: Each line except the last one will have exactly that number of links.
fr: Chaque ligne contiendra ce nombre exact de liens, sauf éventuellement la dernière qui pourra être plus courte.

source: Name of the block in the block list
fr: Nom du bloc dans la liste de blocs

source: Title of the block when displayed
fr: Titre du bloc à l'affichage

source: G2 Glossary pages
fr: Pages du glossaire G2

source: Store latest random entry
fr: Enregistrer le plus récent terme aléatoire tiré

source: When this setting is true (default value), the latest random value is kept in the DB to avoid showing the same pseudo-random value on consecutive page displays. For small sites, it is usually best to keep it saved. For larger sites, unchecking this setting will remove one database write with locking.
fr: Lorsque ce paramètre est vrai (valeur par défaut), la dernière valeur aléatoire est conservée dans la base de données pour éviter de présenter le même tirage pseudo-aléatoire sur deux affichages consécutifs. Pour de petits sites, il est généralement recommandé de conserver cette valeur. Pour des sites plus importants, désactiver ce paramètre permet d'économiser une écriture avec verrouillage de la base de données.

source: Return taxonomy terms for the current entry
fr: Renvoie la liste des termes de taxinomie pour le terme en cours.

source: The taxonomy terms will be returned by XML-RPC and made available to the theme. Default G2 themeing will display them.
fr: Les termes de taxinomie seront renvoyés par XML-RPC est rendus disponible au thème. Le thème par défaut inclus dans G2 les affichera.

source: Random G2 glossary entry
fr: Terme aléatoire dans le glossaire G2

source: Number of items
fr: Nombre d'entrées

source: G2 Top %d
fr: Top %d G2

source: %d most popular G2 glossary entries
fr: %d termes les plus populaires du glossaire G2

source: Entry for the day
fr: Terme du jour

source: Number of text characters to be displayed from entry definition body, if one exists
fr: Nombre de caractères à afficher depuis le corps de la définition du terme, si elle existe

source: Auto-change daily
fr: Changement quotidien automatique

source: This setting will only work if cron or poormanscron is used.
fr: Ce paramètre ne sera opérationnel que si cron ou poormanscron est utilisé.

source: The taxonomy terms will be returned by XML-RPC and made available to the theme. Default G2 themeing will display them.
fr: Les termes de taxinomie seront renvoyés par XML-RPC est rendus disponible au thème. Le thème par défaut inclus dans G2 les affichera.

source: Display feed link
fr: Afficher le lien de flux

source: Should the theme display the link to the RSS feed for this block ?
fr: Faut-il que le thème affiche ou non le lien de flux RSS dans ce bloc ?

source: The feed title
fr: Le titre du flux

source: The title for the feed itself. This will typically be used by aggregators to remind users of the feed and link to it. If nulled, G2 will reset it to the title of the block.
fr: Le titre du flux lui-même. Ceci est typiquement utilisé par les agrégateurs pour remémorer aux utilisateurs l'existence du flux et fournir un titre au lien vers le flux. S'il est effacé, G2 le réinitialisera au titre du bloc.

source: The feed item author
fr: L'auteur de l'article de flux

source: The author name to be included in the feed entries. In this string %author will be replaced by the actual author information. Defaults to %author.
fr: Le nom de l'auteur, tel qu'il doit être inclus dans les entrées de flux. Dans cette chaîne, %author sera remplacé par les informations d'auteur. La valeur par défaut est %author.

source: The feed description
fr: La description du flux

source: The description for the feed itself. This will typically be used by aggregators when describing the feed prior to subscription. It may contain %site, which will dynamically be replaced by the site base URL. If nulled, G2 will reset it to a default description.
fr: La description du flux lui-même. Ceci est typiquement utilisé par les agrégateurs pour pour décrire le flux lors de l'abonnement. Elle peut inclure %site, qui sera substitué à la volée par l'URL de base du site. Si elle est effacée, G2 la réinitialisera à une description par défaut.

source: G2 Glossary filter
fr: Filtre de glossaire G2

source: Allows users to link to G2 entries using &lt;dfn&gt; elements.
fr: Permet aux utilisateurs de lier vers des termes définis dans G2 au moyen d'éléments &lt;dfn&gt;.

source: Wrap <dfn> elements around the terms for which you want a link to the available G2 definition(s).
fr: Entourez d'éléments <dfn> les termes pour lesquels vous voulez voir apparaître un lien vers les définitions G2 disponibles.

source: You may link to G2 definitions using &lt;dfn&gt; elements.
fr: Vous pouvez créer des liens de définition G2 au moyen d'éléments &lt;dfn&gt;.

source: Title
fr: Titre

source: Entry expansion (for acronyms) or translation
fr: Expansion des termes (pour les acronymes), ou traduction

source: Entry definition
fr: Définition du terme

source: Life period of this entry
fr: Epoque du terme

source: This is the period of time during which the entity described by the term was actually alive, not the lifetime of the term itself, since any term is immortal to some extent.
fr: Ceci est l'époque à laquelle l'entité ou concept décrit par le terme était en cours d'existence, plutôt que l'époque du terme lui-même puisque tout terme est dans une certaine mesure immortel.

source: Complement
fr: Complément

source: Information not pertaining to origin of document: comments, notes...
fr: Informations ne relevant pas de l'origine du document: cmomentaires, notes...

source: Origin/I.P.
fr: Origine/P.I.

source: Informations about the origin/IP licensing of the definition
fr: Informations sur l'origine/les informations de P.I. de la définition

source: <p>G2 defines a glossary service for Drupal sites. To compare it with the default Drupal glossary: <ul><li>G2 content is node-based, not term-based</li> <li>G2 leverages existing code from glossary for input filtering and node marking</li> <li>G2 RAM use does not significantly increase with larger entry counts, which makes is more suitable for larger glossaries</li> <li>G2 requests much less from the database than the default glossary</li> <li>G2 uses three taxonomy vcabularies: context, period, and grammatical nature.</li> <li>G2 defines optional blocks</li> <li>G2 is remotely usable via XML-RPC</li> <li>G2 does not provide term feeds</li> <li>G2 access control is simplistic, targeted to non-community sites</ul></p>
fr: <p>G2 définit un service de glossaire pour les sites Drupal. Pour le comparer avec le glossaire par défaut de Drupal:</p><ul> <li>Le contenu de G2 est basé sur les "nodes" et non sur les termes de taxinomie</li> <li>La consomation de mémoire de G2 n'augmente pas de manière significative en fonction du nombre de termes définis, ce qui le rend plus approprié pour des glossaires de grande taille</li> <li>G2 effectue moins de requêtes vers la base de données que le module de glossaire par défaut</li> <li>G2 utilise trois vocabulaires de taxinomie: contexte, période, et nature grammaticale</li> <li>G2 définit des blocs optionnels</li> <li>G2 est utilisable à distance par XML-RPC</li> <li>G2 ne fournit par de flux par terme</li> <li>Le contrôle d'accès de G2 est simpliste, et conçu plus pour les sites éditoriaux que communautaires.</li> </ul>

source: G2 manages a node-based glossary.
fr: G2 gère un glossaire à base de nodes.

source: A G2 entry is a term (usual sense, not drupal sense) for which a definition and various additional information is provided, notably at the editorial level
fr: Un terme G2 (G2 entry) est un terme (au sens commun, et non au sens drupal) pour lequel une définition a été fournie, ainsi que d'autres informations complémentaires, notamment de type éditorial.

source: This block displays a clickable list of initials from the G2 glossary.
fr: Ce bloc affichage une liste cliquable d'initiales de termes du glossaire G2.

source: This block displays a pseudo-random entry (different each time) from the G2 glossary.
fr: Ce bloc affiche un terme pseudo-aléatoire (différent à chaque tirage) pris dans le glossaire G2.

source: Statistics module installed and activated: OK.
fr: Le module de statistiques est installé et activé: OK

source: Statistics module not installed or not activated. Install and activate it and try again.
fr: Le module de statistiques n'est pas installé ou pas activé. Veuillez l'installer et l'activer avant de réessayer.

source: Count content views
fr: Compter les visualisations de contenu

source: setting is
fr: valeur du paramètre

source: Dependencies checklist
fr: Liste de contrôle des dépendances.

source: This block displays a once-a-day entry from the G2 glossary.
fr: Ce bloc affiche un terme par jour choisi dans le glossaire G2.

source: G2 entry
fr: Terme G2

source: Wipe referer info for this entry
fr: Effacer les informations de référent pour ce terme.

source: referers
fr: référents

source: Node used for the main page of G2 on this site
fr: Noeud utilisé pour la page d'accueil de G2 sur ce site

source: When themeing for G2 is supplied by a non-G2-aware theme, the <code>theme_g2_main</code> function will use this node as the main page for the G2 glossary, wrapped between alphabars. This node will typically be an unpublished page or story node. G2-aware themes can provide their own home page, using this page as a basis, or not.
fr: Lorsque la mise en forme de G2 est réalisée par un thème n'ayant pas de fonctions spécifiques G2, la fonction <code>theme_g2_main</code> utilisera ce noeud comme page d'accueil pour le glossaire G2, en l'enveloppant entre deux alphabarres. Ce noeud sera typiquement de type page ou récit. Les thèmes disposant de fonctions spécifiques pour G2 peuvent fournir leur propre page d'accueil, en utilisant ou non cette page comme point de départ.

source: Path for the main page of G2 on this site
fr: Chemin d'accès à la page d'accueil de G2 sur ce site

source: This setting allows site admins to modify the URL at which the home page will be found. This will typically be done to replace the standard path ("g2") by a SEO-engineered path.
fr: Ce paramètre permet aux administrateurs de modifier l'URL auquel se trouve la page d'accueil de G2. Ceci est typiquement effectué pour remplacer le chemin d'accès standard ("g2") par un chemin d'accès optimisé pour le référencement.

source: Embed a CSS-masked version of the definition titles in the node rendition
fr: Inclure une version des titres définitions masquée par CSS dans le rendu des noeuds de termes G2.

source: This setting enables search to work better on definition titles, but can be frowned upon by search engines.
fr: Ce paramètre permet d'améliorer l'efficacité de la recherche intégrée Drupal sur les titres de définitions, mais peut provoquer l'ire des moteurs de recherche.

source: Hide terms from free-tagging vocabularies to users without G2 administrator permissions.
fr: Cacher les termes appartenant à des vocabulaires à marquage libre (free-tagging) de la vue des utilisateurs ne disposant pas de la permission d'administrateur G2.

source: Terms bound to a G2 node belonging in a free tagging vocabulary are typically not meant for end-user consumption.
fr: Les termes de taxinomie liés à un noeud G2 et qui appartient à un vocabulaire à marquage libre ne sont typiquement pas destinés à l'usage des simples visiteurs.

source: Node used for the homonyms disambiguation page of G2 on this site
fr: Noeud utilisé comme page d'homonymie de G2 sur ce site

source: If this node is non-zero, this is the page used to build the disambiguation page for G2 entries at <code>&lt;drupal&gt;/g2/entries/&lt;someentry&gt;</code>. Otherwise, a default page is used.
fr: Si le numéro de ce noeud est différent de zéro, le noeud correspondant sera utilisé pour construire la pge des termes G2 homonymes présente à <code>&lt;drupal&gt;/g2/entries/&lt;uneentrée&gt;</code>. Sinon, une page par défaut sera utilisée.

source: Enable auto-jump to single match on entry
fr: Activer le saut automatique vers les correspondances uniques.

source: This setting enables automatic redirection from <code>&lt;drupal&gt;/g2/entries/someeentry</code> to the entry page if only one match exists for "someentry". This is especially useful for links generated from content nodes.
fr: Ce paramètre permet un renvoi automatique depuis <code>&lt;drupal&gt;/g2/entries/uneentrée</code> vers la page contenant la définition correspondante si un seul terme correspond à "uneentrée". Ceci est particulièrement utile pour les liens construit à partir des noeuds de contenu.

source: None
fr: Aucun

source: Vocabulary to be used on the homonyms disambiguation page
fr: Vocabulaire à utiliser sur la page d'homonymie.

source: If a vocabulary is chosen here, the terms bound to ambiguous entries (homonyms) will be displayed on the defaut disambiguation page.
fr: Si un vocabulaire est choisi ici, les termes de taxinomie liés aux termes G2 ambigus (homonymes) seront affichés sur la page d'homonymie.

source: Advanced settings (for programmers only)
fr: Paramètres avancées (pour programmeurs)

source: Enable G2 remote XML-RPC services
fr: Activer les services XML-RPC distants

source: This setting enables remote anonymous use of the G2 glossary through its XML-RPC services. Enabling it without additional access control is typically not a good idea. Note that local XML-RPC is always enabled, which may need to be modified on shared hosts.
fr: Ce paramètre permet l'utilisation anonyme à distance du glossaire G2 au-travers de ses services XML-RPC. L'activer sans contrôle d'accès complémentaire n'est typiquement pas une bonne idée. Remarquer que le XML-RPC local est toujours activé, ce qui peut nécessiter des mesures de protection sur les hébergements partagés.

source: This site is running G2 version %version. See the <a href="%page" title="G2 Glossary project page">G2 project page</a> on Drupal.org.
fr: Ce site exploite la version %version de G2. Voir la <a href="%page" title="Page du projet Glossaire G2">Page du project G2</a> sur Drupal.org.

source: An event may not end before it starts.
fr: Un évènement ne peut se terminer avant d'avoir commencé.

source: Definition
fr: Définition

source: In other words
fr: En d'autres termes

source: Term time period
fr: Epoque du terme

source: [offline]
fr: [hors ligne]

source: <p>There are currently no entries for "%entry".</p>
fr: <p>Il n'y a actuellement aucun terme défini correspondant à "%entry".</p>

source: <p>Would you like to <a href="%url" title="Create new entry for %entry">create</a> one ?</p>
fr: <p>Voudriez-vous en <a href="%url" title="Créer un nouveau terme défini pour %entry">créer</a> un ?</p>

source: %link : %incoming incoming clicks
fr: %link: %incoming clics entrants

source: WARNING: just because a click came from a node doesn't mean the node has a link. The click may have come from a block on the page. These stats are just a hint for editors.
fr: ATTENTION: ce n'est pas parce qu'un clic provient d'un noeud que ce noeud contient un lien: le clic peut provenir d'un bloc présent sur la page. Ces statistiques ne sont qu'un indice pour les éditeurs.

source: Local referers for this node
fr: Référents locaux pour ce noeud

source: 10 most recently changed only
fr: 10 termes les plus récemment mis à jour

source: Owned G2 nodes
fr: Termes G2 rédigés
